{"title":"g Guide/Lesson Template TITLE: Let’s Play  T1 U2 L4 Lesson Description Text:The student will be introduced to the different play actions in this lesson. Knowing different activities are key verbs that the student needs to know to help with describing different things and building an English vocabulary. The student will learn how to pronounce and spell different actions. The student will learn how to describe different actions using words they learned already in previous lessons. The student will respond in complete sentences.  Student Learning Objectives:At completion of this lesson, student will be able to:Recognize, spell, and pronounce the words different actions students take while playing. Spell and pronounce commonly associated words.Use words in complete sentences.  Word List:  kick, run, outside, inside, jump, ball, action, sit OPENER/GREETING SLIDES Slide 1: Opener SlideThis slide will always be the Naativ-branded opener slide that the teacher will display as the student enters the classroom. Slide 2:Greet your student and introduce the lesson concept: Today, we are going to be learning about actions and ways to play. INSTRUCTION/ACTIVITY SLIDES Slide Number 3Student Actions/OutputSay and spell action. Circle different actions.Say the words for the actions on the slide: Run, jump, sit, playTeaching TipsSay and write action on the screen for student. Have the student repeat it and write it out on a separate piece of paper or on the screen. Point to the figure doing a running motion. Say run. Have students repeat. Visual cue: Do a walking action as you teach students the word run.Have students identify the different action icons (this will distinguish students background knowledge).  Slide Number 4Student Actions/OutputSay and write run. Say the phrase, I can run. Circle the picture that shows the girl running. Do the action for running. Teaching TipsSay and spell out the word run. Have student repeat. Say and write out the phrase, I can run. Have students repeatVisual cue: Do the action for running (if possible) as you and student get to run. Have students circle the picture that shows a figure running. Slide Number 5Student Actions/OutputSay and write outside. Say the phrase, I run outside. Circle the picture that shows an outside scene. Teaching TipsSay and spell out the word outside. Have student repeat and spell out the word. Students should recall this word from Unit 1, Lesson 8Say and write out the phrase I run outside. Have students repeat. Visual cue: Have students complete different actions for the words as they say the phrase. For example, student can point to self at “I”, do running action at “run”, and can make like they are opening a door when they say “outside.”Slide Number 6Student Actions/OutputSay and write jumpSay the phrase, I can jump. Circle the picture that shows the figure jumping. Do the action for jumping. Teaching TipsSay and spell out the word jump. Have student repeat. Say and write out the phrase, I can jump. Have student repeatVisual cue: Do the action for jumping as you and the student get to jump. Have student circle the picture that shows a figure jumping.Slide Number 7Student Actions/OutputSay and write sit. Say the phrase, I can sit. Circle the picture that shows the figure sitting. Do the action for sitting. Teaching TipsSay and spell out the word sit. Have student repeat. Say and write out the phrase, I can sit. Have student repeatVisual cue: Do the action for sitting (in a chair if possible) as you and the student.Prompt the student to identify where the girl is sitting: In a chair.Have student circle the picture that shows a figure sitting. Slide Number 8Student Actions/OutputSay and spell insideSay the phrase, I sit inside.  Do actions to show understanding of sentence.Teaching TipsSay and spell out the word inside. Have student repeat and spell out the word. Say and write out the phrase I sit inside. Have students repeat. Visual cue: Have students complete different actions for the words as they say the phrase. For example, student can point to self at “I”, do sitting action at “sit”, etc. Slide Number 9Student Actions/OutputSay and write kickSay the phrase, I can kick the ballCircle the picture that shows kicking.Do the action for kicking. Teaching TipsSay and spell out the word kick. Have student repeat. Say and write out the phrase, I can kick the ball. Have student repeatVisual cue: Do the action for kicking (can be pretending to kick a ball)Have student circle the picture that shows a figure kicking. Slide Number 10Student Actions/OutputSay and write He can kick the ball. Circle the picture of the boy.Do the action for kicking. Teaching TipsSay and write the phrase He can kick the ball. Have students say and write out the phrase on a separate piece of paper. Circle the picture of the boy. Have students say the phrase while acting it out (i.e. point away from self for “he”, kicking motion for “kick.”)Slide Number 11Student Actions/OutputSay and the phrase, The dog runs. Circle the dog in the picture. Act out the actions for running. Teaching TipsSay and spell out the phrase The dog runs. Have student repeat.Prompt the student to recognize the variation of the verb “run” Have student circle the dog in the picture. Have student act out the actions for running as they say the sentence (i.e. When they get to “dog” make the sound a dog would make, then do the action for running when they say “runs.”)Slide Number 12Student Actions/OutputSay the phrase She jumps on the bed. Circle the girl in the picture. Do the actions for jumping.                            Teaching TipsSay the phrase She jumps on the bed. Have student repeatPrompt the student to recognize the variation of the verb “jump” Circle the girl in the picture that shows jumping on a bed.Do the actions for jumping. Slide Number 13Student Actions/OutputSay the phrase, He sits inside. Circle the boy sitting inside picture.Do the actions for sitting. Teaching TipsSay and write out the phrase He sits inside. Have student repeat.Prompt the student to recognize the variation of the verb “sit” Help student circle the picture that shows the boy sitting inside. Have student do the action for sitting. Slide Number 14Student Actions/OutputChoose the correct sight word to fill in the blank in the sentence frameSay “He runs after the girl.”Circle the boy(s) who are running after the girl(s).Teaching Tips Circle the pictures of the boys running after the girls. Ask student to describe what she is doing by selecting the correct word to complete the sentence. student can instead use these actions instead of speaking their answer: one finger (runs), two fingers (jumps), three fingers (sits). Have the child say their answer in a complete sentence: He runs after the girl. Slide 15Student Actions/OutputChoose the correct sight word to fill in the blank in the sentence frameSay “He sits on the chair.”Circle the boy sitting on the chair. Teaching TipsCircle the picture of the boy. Ask student to describe what he is doing by selecting the correct word to complete the sentence. Student can instead use these actions instead of speaking their answer: one finger (runs), two fingers (jumps), three fingers (sits). Have the child say their answer in a complete sentence: He sits on the chair.Slide Number 16Student Actions/OutputChoose the correct sight word to fill in the blank in the sentence frameSay “He plays outside.”Circle the boy kicking the ball.Teaching TipsPoint to the grass/outside and have student circle it. Ask student to select the correct word to complete the sentence. Student can instead use these actions instead of speaking their answer: one finger (outside), two fingers (inside), three fingers (action). Have the child say their answer in a complete sentence: He plays outside.Slide Number 17Student Actions/OutputChoose the correct sight word to fill in the blank in the sentence frameSay “She sits inside.”Circle the girl sitting in the window.Teaching TipsCircle the picture of the girl. Ask student to answer the question in a complete sentenceGive student the following sentence frame to use for their answer: She sits inside. Slide Number 18Student Actions/OutputChoose the correct sight word to fill in the blank in the sentence frameSay “The boy runs.”Circle the boy running.Teaching TipsCircle the picture of the boy. Ask student to answer the question in a complete sentence.Give student the following sentence frame to use for their answer: The boy runs.  Slide Number 19Student Actions/OutputChoose the correct sight word to fill in the blank in the sentence frameSay “The ball is outside.”Circle the ball and the grass.Teaching TipsCircle the picture of the ball. Ask student to answer the question “Where is the ball?” in a complete sentenceGive student the following sentence frame to use for their answer: The ball is _____________ (outside).Slide Number 20Student Actions/OutputChoose the correct sight word to fill in the blank in the sentence frameSay “The boy jumps.”Circle the boy jumping.Teaching TipsCircle the picture of the boy. Ask student to answer the question “What is the boy doing?” in a complete sentence.Give student the following sentence frame to use for their answer: The boy jumps. CONVERSATION ACTIVITIES SLIDESFreeform “Show and Tell” Conversation Activity Slide Number 21Student Actions/Output Student should have a blank slide to draw a picture of different actions.Read words from the lesson (kick, run, outside, inside, jump, ball, action, sit).Teaching Tips Teacher will prompt student to draw a picture to represent the different actions through pictures. One prompt at a time. Teacher will write words from the lesson (kick, run, outside, inside, jump, ball, action, sit) and student will read them.  Word Wall Vocabulary Builder Activity Slide Number 22Student Actions/Output Student will read and spell their new words (kick, run, outside, inside, jump, ball, action, sit)Teaching Tips Teacher will give feedback on the spelling and pronunciation of the new words.   ","description":"","objectives":[],"wordList":"","images":"","slides":{}}